## staging: elasticache
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 16 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                      |
|--------|-------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[2]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[0]`         |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[1]`         |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[2]`         |
|        | `aws_elasticache_replication_group.elasticache_queue_cache[0]`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
      + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster001CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 70
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
      + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster002CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 70
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
      + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster003CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 70
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
      + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster001"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
      + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster002"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
      + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster003"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
      + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster001"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
      + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster002"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
      + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster003"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
      + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster001"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
      + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster002"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
      + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster003"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_medium_cpu_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 50% during 1 minute"
      + alarm_name                            = "elasticache-queue-medium-cpu-warning-CacheCluster001CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_medium_cpu_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 50% during 1 minute"
      + alarm_name                            = "elasticache-queue-medium-cpu-warning-CacheCluster002CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_medium_cpu_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average CPU of Redis ElastiCache >= 50% during 1 minute"
      + alarm_name                            = "elasticache-queue-medium-cpu-warning-CacheCluster003CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "breaching"
    }

  # aws_elasticache_replication_group.elasticache_queue_cache[0] will be created
  + resource "aws_elasticache_replication_group" "elasticache_queue_cache" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Redis/Valkey multiaz cluster with replication group for Celery queues"
      + engine                         = "valkey"
      + engine_version                 = "8.0"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = "thu:04:00-thu:05:00"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = true
      + network_type                   = (known after apply)
      + node_type                      = "cache.t3.medium"
      + num_cache_clusters             = 3
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "default.valkey8"
      + port                           = 6379
      + preferred_cache_cluster_azs    = [
          + "ca-central-1b",
          + "ca-central-1d",
          + "ca-central-1a",
        ]
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "notify-staging-queue-cache"
      + security_group_ids             = [
          + "sg-0cef7766b6ebf336c",
          + "sg-0e2c3ef6c5c75b74c",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "notification-canada-ca-staging-cache-subnet"
      + tags                           = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                       = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + transit_encryption_enabled     = (known after apply)
      + transit_encryption_mode        = (known after apply)

      + log_delivery_configuration {
          + destination      = "/aws/elasticache/notify-staging-queue-cache/engine-logs"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
      + log_delivery_configuration {
          + destination      = "/aws/elasticache/notify-staging-queue-cache/slow-logs"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + elasticache_queue_cache_primary_endpoint_address = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.elasticache_queue_cache_engine_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.elasticache_queue_cache_slow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-engine-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-slow-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.redis-batch-saving"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
